In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
rentals = pd.read_csv('rental.csv', encoding='latin1')
df = rentals.copy()
df.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [3]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 254.0 KB

In [4]:
df.columns = [c.lower()  for c in df.columns] #con esto ponemos todo en minusculas son buenas practicas

In [5]:
df.columns = df.columns.str.strip() # Ahora eliminamos espacios en blanco al principio y al final de los nombres de las columnas

In [6]:
df.duplicated().sum()  #Duplicados del DataFrame

0

In [7]:
df = df.drop(['last_update'], axis=1) #EMILINAR COLUMNA

In [8]:
df.columns

Index(['rental_id', 'rental_date', 'inventory_id', 'customer_id',
       'return_date', 'staff_id'],
      dtype='object')

In [9]:

df['inventory_id'] = df['rental_id']

In [10]:
df.tail()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
995,997,2005-05-31 00:08:25,997,216,2005-06-02 00:17:25,2
996,998,2005-05-31 00:16:57,998,389,2005-06-01 22:41:57,1
997,999,2005-05-31 00:25:10,999,413,2005-06-03 06:05:10,2
998,1000,2005-05-31 00:25:56,1000,332,2005-06-08 19:42:56,2
999,1001,2005-05-31 00:46:31,1001,64,2005-06-06 06:14:31,2

In [11]:
df['inventory_id'].nunique() #VALORES UNICOS

1000

In [12]:
df.reset_index(inplace=True, drop=True) #RESETEAR INDICE

In [13]:
df['inventory_id'] = range(1, len(df) + 1) #como tengo un error en los valores, los reseteo para que sean consecutivos

In [14]:
df['rental_id'] = range(1, len(df) + 1) #como tengo un error en los valores, los reseteo para que sean consecutivos

In [15]:
df.tail()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
995,996,2005-05-31 00:08:25,996,216,2005-06-02 00:17:25,2
996,997,2005-05-31 00:16:57,997,389,2005-06-01 22:41:57,1
997,998,2005-05-31 00:25:10,998,413,2005-06-03 06:05:10,2
998,999,2005-05-31 00:25:56,999,332,2005-06-08 19:42:56,2
999,1000,2005-05-31 00:46:31,1000,64,2005-06-06 06:14:31,2

In [16]:
df['customer_id'].nunique() #VALORES UNICOS

485

In [17]:
numbers = list(range(1, 1001))  #con esto creo una lista de numeros del 1 al 1000
np.random.shuffle(numbers) #con esto los mezclo de manera aleatoria

In [18]:
df['customer_id'] = numbers #actualizo mi lista de clientes

In [19]:
df.tail()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
995,996,2005-05-31 00:08:25,996,709,2005-06-02 00:17:25,2
996,997,2005-05-31 00:16:57,997,416,2005-06-01 22:41:57,1
997,998,2005-05-31 00:25:10,998,170,2005-06-03 06:05:10,2
998,999,2005-05-31 00:25:56,999,551,2005-06-08 19:42:56,2
999,1000,2005-05-31 00:46:31,1000,121,2005-06-06 06:14:31,2

In [20]:
df['customer_id'].nunique() #VALORES UNICOS

1000

In [21]:
df.to_csv('../src/rental_limpio.csv', index=False) # guardamos en la carpeta src el archivo limpio.

In [22]:
from sqlalchemy import create_engine
import pymysql

In [23]:
str_conn = f'mysql+pymysql://root:a1b2e3l4_IRONHACK@localhost:3306/movies'
cursor = create_engine(str_conn)

In [24]:
df.to_sql(name='rental',
            con=cursor,
            if_exists='replace',
            index=False)

1000